app/controllers/punishments_controller.rb

  def index
    @punishments = Punishment.all
---
SELECT * FROM `punishments`

  def show
    @punishment = Punishment.find(params[:id])
---
SELECT * FROM `punishments` WHERE (`punishments`.`id` = 1)

  def create
    @punishment = Punishment.new(params[:punishment])
    if @punishment.save
---
INSERT INTO `punishments` (`name`, `created_at`, `updated_at`, `description`) VALUES('Spanking', '2010-08-11 12:30:35', '2010-08-11 12:30:35', 'Striking the buttocks with a bare hand')