app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.all
---
SELECT * FROM `surveys`

  def show
    @survey = Survey.find(params[:id])
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)

  def new
    @values = %w(Never Rarely Occassionally Sometimes Always)
    @survey = Survey.new
    Punishment.all.each do |p|
---
SELECT * FROM `punishments`

  def create
    @survey = Survey.new(params[:survey])
    if @survey.save
---
INSERT INTO `surveys` (`created_at`, `updated_at`, `submitted_by`) VALUES('2010-08-11 13:02:09', '2010-08-11 13:02:09', 'Dave')

  def edit
    @survey = Survey.find(params[:id])
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)

  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
DELETE FROM `surveys` WHERE `id` = 1